tutorials/precice/volume_coupled/fl2_simple/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      preciceDict;
}

preciceConfig "../precice-config-simple.xml";
participant Fluid2;

modules (FF);

interfaces
{
  Interface1
  {
    mesh      Fluid2-Mesh;
    patches   ();
    cellSets  (box1);
    locations volumeCenters;

    readData  (Velocity);
    writeData ();
  };
};

FF
{
  nameU U_vol;
};
